Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: Bind only to configured interface addresses, instead of the wildcard address.
sv: Bind endast till konfigurerade gränssnittsadresser i stället för jokeradressen.

source: Bind service records to a domain name: specify the location of services.
sv: Bind tjänsteposter till ett domännamn: ange var tjänsterna finns.

source: Bind service records to a domain name: specify the location of services. See <a href="%s">RFC2782</a>.
sv: Bind tjänsteposter till ett domännamn: ange var tjänsterna finns. Se <a href="%s">RFC2782</a>.

source: Bind the tunnel to this interface (optional).
sv: Bind tunneln till det här gränssnittet (valfritt).

source: Bind to Interface
sv: Bind till gränssnitt

source: Bitrate
sv: Bithastighet

source: Bonding Mode
sv: Bonding-läge

source: Bonding/Aggregation device
sv: Bonding-/aggregeringsenhet

source: Both "Relay from" and "Relay to address" must be specified.
sv: Både ”Relä från” och ”Relä till adress” måste anges.

source: Bridge
sv: brygga

source: Bridge VLAN filtering
sv: VLAN-filtrering för brygga

source: Bridge VLAN filtering dialog
sv: Dialogruta för VLAN-filtrering i brygga

source: Bridge device
sv: Bryggenhet

source: Bridge port specific options
sv: Port-specifika alternativ för brygga

source: Bridge ports
sv: Portar för brygga

source: Bridge traffic table "%h"
sv: Trafiktabell för brygga ”%h”

source: Bridge unit number
sv: Enhetsnummer för brygga

source: Bring up empty bridge
sv: Aktivera tom brygga

source: Bring up on boot
sv: Slå på vid uppstart

source: Bring up the bridge interface even if no ports are attached
sv: Aktivera brygggränssnittet även om inga portar är anslutna

source: Browse…
sv: Bläddra…

source: Buffered
sv: Buffrad

source: By default, dnsmasq caches A, AAAA, CNAME and SRV DNS record types.
sv: Som standard cachar dnsmasq DNS-posttyperna A, AAAA, CNAME och SRV.

source: CA certificate (PEM encoded. Use instead of system-wide store to verify the gateway certificate.)
sv: CA-certifikat (PEM-kodat. Använd i stället för systemets certifikatarkiv för att verifiera gatewaycertifikatet.)

source: CA certificate; if empty it will be saved after the first connection.
sv: CA-certifikat; om tom så kommer den att sparas efter första anslutningen.

source: CA path
sv: CA-sökväg

source: CLAT configuration failed
sv: CLAT konfiguration misslyckades

source: CNAME or fqdn
sv: CNAME eller FQDN

source: CPU usage (%)
sv: CPU-användning (%)

source: Cache arbitrary RR
sv: Cacha godtyckliga resursposter

source: Cached
sv: Lagrat i cache

source: Call down cmd/script before TUN/TAP close
sv: Kör down-kommando/-skript innan TUN/TAP stängs

source: Call failed
sv: Anrop misslyckades

source: Can be hinted by adding 4 or 6 to the name.
sv: Kan anges som ledtråd genom att lägga till 4 eller 6 i namnet.

source: Can be useful if ISP has IPv6 nameservers but does not provide IPv6 routing.
sv: Kan vara användbart om internetleverantören har IPv6-namnservrar men inte erbjuder IPv6-routning.

source: Cannot parse configuration: %s
sv: Det går inte att tolka konfigurationen: %s

source: Carrier
sv: Operatör

source: Cell Location
sv: Cellposition

source: Cellular Network
sv: Mobilnät

source: Certificate authority
sv: Certifikatutfärdare

source: Certificate constraint (Domain)
sv: Certifikatbegränsning (domän)

source: Certificate constraint (SAN)
sv: Certifikatbegränsning (SAN)

source: Certificate constraint (Subject)
sv: Certifikatbegränsning (Subject)

source: Certificate constraint (Wildcard)
sv: Certifikatbegränsning (jokertecken)

source: Certificate constraint substring - e.g. /CN=wifi.mycompany.com<br />See `logread -f` during handshake for actual values
sv: Delsträng för certifikatbegränsning – t.ex. /CN=wifi.mycompany.com<br />Se `logread -f` under handskakningen för faktiska värden

source: Certificate constraint(s) against DNS SAN values (if available)<br />or Subject CN (exact match)
sv: Certifikatbegränsning(ar) mot DNS-SAN-värden (om tillgängliga)<br />eller Subject CN (exakt matchning)

source: Certificate constraint(s) against DNS SAN values (if available)<br />or Subject CN (suffix match)
sv: Certifikatbegränsning(ar) mot DNS-SAN-värden (om tillgängliga)<br />eller Subject CN (suffixmatchning)

source: Certificate constraint(s) via Subject Alternate Name values<br />(supported attributes: EMAIL, DNS, URI) - e.g. DNS:wifi.mycompany.com
sv: Certifikatbegränsning(ar) via Subject Alternative Name-värden<br />(attribut som stöds: EMAIL, DNS, URI) – t.ex. DNS:wifi.mycompany.com

source: Change password for rpcd user
sv: Ändra lösenord för rpcd-användare

source: Change process priority
sv: Ändra process-prioritet

source: Change to directory before initialization
sv: Byt till katalog före initiering

source: Changes have been made to the existing connection via "%h". This could inhibit access to this device. Any IP change requires <strong>connecting to the new IP</strong> within %d seconds to retain the changes.
sv: Ändringar har gjorts i den befintliga anslutningen via ”%h”. Detta kan påverka åtkomsten till enheten. Vid ändring av IP-adress måste du <strong>ansluta till den nya IP-adressen</strong> inom %d sekunder för att behålla ändringarna.

source: Changes have been reverted.
sv: Ändringar har återställts.

source: Changes have been staged. Use "Save & Apply" or the "Unsaved Changes" indicator to apply them.
sv: Ändringarna har förberetts. Använd ”Spara och tillämpa” eller indikatorn ”Osparade ändringar” för att tillämpa dem.

source: Changes the password for accessing the device as (rpcd) user
sv: Ändrar lösenordet för åtkomst till enheten som (rpcd)-användare

source: Channel Analysis
sv: Analys för kanaler

source: Channel Width
sv: Räckvidd för kanal

source: Check filesystems before mount
sv: Kontrollera filsystemen innan de monteras

source: Check peer certificate against a CRL
sv: Kontrollera jämlikens certifikat mot en CRL

source: Check this option to delete the existing networks from this radio.
sv: Bocka för det här alternativet för att ta bort befintliga nätverk från den här radion.

source: Checking archive…
sv: Kontrollerar arkivet…

source: Checking image…
sv: Kontrollerar avbilden…

source: Choose a unique name.
sv: Välj ett unikt namn.

source: Choose mtdblock
sv: Välj mtdblock

source: Choose the firewall zone you want to assign to this interface. Select <em>unspecified</em> to remove the interface from the associated zone or fill out the <em>custom</em> field to define a new zone and attach the interface to it.
sv: Välj den brandväggszon som ska tilldelas gränssnittet. Välj <em>ospecificerad</em> för att ta bort gränssnittet från den associerade zonen eller fyll i fältet <em>anpassad</em> för att definiera en ny zon och ansluta gränssnittet till den.

source: Choose the network(s) you want to attach to this wireless interface or fill out the <em>custom</em> field to define a new network.
sv: Välj de nätverk som ska anslutas till det här trådlösa gränssnittet eller fyll i fältet <em>anpassad</em> för att definiera ett nytt nätverk.

source: Chroot to directory after initialization
sv: Chroot till katalog efter initiering

source: Cipher
sv: Chiffer

source: Cisco UDP encapsulation
sv: Cisco UDP-inkapsling

source: Clear selection
sv: Rensa markering

source: Click "Generate archive" to download a tar archive of the current configuration files.
sv: Klicka på ”Skapa arkiv” för att hämta ett tar-arkiv med de aktuella konfigurationsfilerna.

source: Click "Save mtdblock" to download specified mtdblock file. (NOTE: THIS FEATURE IS FOR PROFESSIONALS! )
sv: Klicka på ”Spara mtdblock” för att hämta den angivna mtdblock-filen. (OBS! DEN HÄR FUNKTIONEN ÄR AVSEDD FÖR PROFESSIONELLA ANVÄNDARE!)

source: Client ID to send when requesting DHCP
sv: Klient-ID att skicka vid DHCP-förfrågning

source: Client is disabled
sv: Klienten är avstängd

source: Client metadata
sv: Klientmetadata

source: Clone
sv: Klona

source: Close inactive connection after the given amount of seconds, use 0 to persist connection
sv: Stäng inaktiv anslutning efter angivet antal sekunder; använd 0 för att behålla anslutningen

source: Cold standby; Establish a connection only when no other interface is available (slower)
sv: Kall reserv; upprätta en anslutning endast när inget annat gränssnitt är tillgängligt (långsammare)

source: Collapse menu
sv: Fäll ihop menyn

source: Collecting data...
sv: Samlar in data...

source: Collisions seen
sv: Observerade kollisioner

source: Command OK
sv: Kommandot OK

source: Command failed
sv: Kommandot misslyckades

source: Common name or numeric ID of the %s in which this route is found
sv: Namn eller numeriskt ID för %s där den här rutten finns

source: Complicates key reinstallation attacks on the client side by disabling retransmission of EAPOL-Key frames that are used to install keys. This workaround might cause interoperability issues and reduced robustness of key negotiation especially in environments with heavy traffic load.
sv: Försvårar återinstallationsattacker mot nycklar på klientsidan genom att inaktivera återsändning av EAPOL-Key-ramar som används för att installera nycklar. Den här lösningen kan orsaka kompatibilitetsproblem och göra nyckelförhandlingen mindre robust, särskilt i miljöer med hög trafikbelastning.

source: Compute outgoing checksum (optional).
sv: Beräkna utgående kontrollsumma (valfritt).

source: Config File
sv: Konfigurationsfil

source: Configuration Export
sv: Export av konfiguration

source: Configuration changes applied.
sv: Konfigurationsändringar sparade.

source: Configuration changes have been rolled back!
sv: Konfigurationsändringar har återställts!

source: Configuration failed
sv: Konfiguration misslyckades

source: Configure VLANs and per-port VLAN membership on bridge device
sv: Konfigurera VLAN och VLAN-medlemskap per port på bryggenheten

source: Configure client mode
sv: Ställ in klient-läge

source: Configure server Ipv6 mode
sv: Konfigurera serverns IPv6-läge

source: Configure server bridge
sv: Konfigurera serverbrygga

source: Configure server mode
sv: Konfigurera serverläge

source: Configures data rates based on the coverage cell density. Normal configures basic rates to 6, 12, 24 Mbps if legacy 802.11b rates are not used else to 5.5, 11 Mbps. High configures basic rates to 12, 24 Mbps if legacy 802.11b rates are not used else to the 11 Mbps rate. Very High configures 24 Mbps as the basic rate. Supported rates lower than the minimum basic rate are not offered.
sv: Konfigurerar datahastigheter utifrån tätheten i täckningsområdet. Normal anger grundhastigheter till 6, 12 och 24 Mbit/s om äldre 802.11b-hastigheter inte används, annars 5,5 och 11 Mbit/s. Hög anger grundhastigheter till 12 och 24 Mbit/s om äldre 802.11b-hastigheter inte används, annars 11 Mbit/s. Mycket hög anger 24 Mbit/s som grundhastighet. Stödda hastigheter som är lägre än den minsta grundhastigheten erbjuds inte.

source: Configures the default router advertisement in <abbr title="Router Advertisement">RA</abbr> messages.
sv: Konfigurerar annonseringen av standardrouter i <abbr title="Router Advertisement">RA</abbr>-meddelanden.

source: Configures the minimum delegated prefix length assigned to a requesting downstream router, potentially overriding a requested prefix length. If left unspecified, the device will assign the smallest available prefix greater than or equal to the requested prefix.
sv: Konfigurerar den minsta delegerade prefixlängd som tilldelas en begärande nedströmsrouter och kan åsidosätta en begärd prefixlängd. Om inget anges tilldelar enheten det minsta tillgängliga prefix som är större än eller lika med det begärda prefixet.

source: Configures the operation mode of the <abbr title="Router Advertisement">RA</abbr> service on this interface.
sv: Konfigurerar driftläget för <abbr title="Router Advertisement">RA</abbr>-tjänsten på det här gränssnittet.

source: Configures the operation mode of the DHCPv6 service on this interface.
sv: Konfigurerar driftläget för DHCPv6-tjänsten på det här gränssnittet.

source: Configures the operation mode of the NDP proxy service on this interface.
sv: Konfigurerar driftläget för NDP-proxytjänsten på det här gränssnittet.

source: Confirm disconnect
sv: Bekräfta frånkoppling

source: Confirmation
sv: Bekräftelse

source: Connect through Socks5 proxy
sv: Anslut genom Socks5-proxy

source: Connect to remote host through an HTTP proxy
sv: Anslut till en fjärrvärd genom en HTTP-proxy

source: Connection attempt failed
sv: Anslutningsförsök misslyckades

source: Connection attempt failed.
sv: Anslutningsförsöket misslyckades.

source: Connection endpoint
sv: Anslutningens slutpunkt

source: Connection retry interval
sv: Intervall mellan anslutningsförsök

source: Connectivity change
sv: Förändring i anslutbarhet

source: Contents have been saved.
sv: Innehållet har sparats.

source: Continue in calling chain
sv: Fortsätt i anropande kedja

source: Controls retransmitted Neighbor Solicitation messages; published in <abbr title="Router Advertisement">RA</abbr> messages.
sv: Styr återsända Neighbor Solicitation-meddelanden; publiceras i <abbr title="Router Advertisement">RA</abbr>-meddelanden.

source: Controls the receive (RX) flow control
sv: Styr flödeskontroll för mottagning (RX)

source: Controls the transmission (TX) flow control
sv: Styr flödeskontroll för sändning (TX)

source: Could not regain access to the device after applying the configuration changes. You might need to reconnect if you modified network related settings such as the IP address or wireless security credentials.
sv: Det gick inte att återfå åtkomsten till enheten efter att konfigurationsändringarna tillämpats. Du kan behöva ansluta igen om du ändrade nätverksrelaterade inställningar, till exempel IP-adressen eller säkerhetsuppgifter för det trådlösa nätverket.

source: Coverage cell density
sv: Täthet i täckningsområde

source: Create / Assign firewall-zone
sv: Skapa/tilldela brandväggszon

source: Create Directory
sv: Skapa katalog

source: Create interface
sv: Skapa gränssnitt

source: Critical
sv: Kritiskt

source: Cron Log Level
sv: Loggnivå för Cron

source: Cross Pass (Japan only)
sv: Cross Pass (endast Japan)

source: Cryptography
sv: Kryptografi

source: Current power
sv: Nuvarande ström

source: Custom Interface
sv: Anpassat gränssnitt

source: Custom files (certificates, scripts) may remain on the system. To prevent this, perform a factory-reset first.
sv: Egna filer (certifikat, skript) kan finnas kvar på systemet. Gör först en fabriksåterställning för att förhindra detta.

source: Custom flash interval (kernel: timer)
sv: Eget blinkintervall (kärna: timer)

source: Customizes the behaviour of the device <abbr title="Light Emitting Diode">LED</abbr>s if possible.
sv: Anpassar beteendet för enhetens <abbr title="Light Emitting Diode">LED</abbr>-lampor om möjligt.

source: DAD transmits
sv: DAD-överföringar

source: DAE-Client
sv: DAE-klient

source: DAE-Secret
sv: DAE-nyckel

source: DHCP Leases
sv: DHCP-lån

source: DHCP Options
sv: Alternativ för DHCP

source: DHCP client
sv: DHCP-klient

source: DHCP-Options
sv: DHCP-alternativ

source: DHCPv4 Service
sv: DHCPv4-tjänst

source: DHCPv6 Settings
sv: DHCPv6-inställningar

source: DHCPv6 Statistics
sv: DHCPv6-statistik

source: DHCPv6 client
sv: DHCPv6-klient

source: DHCPv6-Service
sv: DHCPv6-tjänst

source: DNS Forwards
sv: DNS Vidarebefordringar

source: DNS Records
sv: DNS-poster

source: DNS query port
sv: Port för DNS-frågor

source: DNS servers for the remote clients using this tunnel to your openwrt device. Some wireguard clients require this to be set.
sv: DNS-servrar för fjärrklienter som använder den här tunneln till din OpenWrt-enhet. Vissa WireGuard-klienter kräver att detta anges.

source: DNS setting is invalid
sv: DNS-inställningen är ogiltig

source: DNS weight
sv: DNS-vikt

source: DNS-Label / FQDN
sv: DNS-etikett/FQDN

source: DNSSEC check unsigned
sv: DNSSEC-kontroll av osignerat

source: DPD Idle Timeout
sv: DPD-tidsgräns vid inaktivitet

source: DS-Lite AFTR address
sv: DS-Lite AFTR-adress

source: DSL line mode
sv: DSL-ledningsläge

source: DTIM Interval
sv: DTIM-intervall

source: DUID with an even number (20 to 260) of hexadecimal characters
sv: DUID med ett jämnt antal (20 till 260) hexadecimala tecken

source: DUID/IAIDs
sv: DUID/IAID:er

source: Daemon
sv: Demon

source: Data Rate
sv: Datahastighet

source: Data Received
sv: Mottagen data

source: Data Transmitted
sv: Överförd data

source: Debug
sv: Felsökning

source: Default DUID
sv: Standard-DUID

source: Default gateway
sv: Standard gateway

source: Default router
sv: Standard-router

source: Default state
sv: Standardläge

source: Defaults to IPv4+6.
sv: Standard är IPv4+6.

source: Defaults to fw4.
sv: Standard är fw4.

source: Define additional DHCP options, for example "<code>6,192.168.2.1,192.168.2.2</code>" which advertises different DNS servers to clients (dnsmasq only).
sv: Definiera ytterligare DHCP-alternativ, till exempel ”<code>6,192.168.2.1,192.168.2.2</code>”, som annonserar andra DNS-servrar till klienter (endast dnsmasq).

source: Defines a mapping of Linux internal packet priority to VLAN header priority but for outgoing frames
sv: Definierar en mappning från Linux interna paketprioritet till VLAN-huvudets prioritet för utgående ramar

source: Defines a mapping of VLAN header priority to the Linux internal packet priority on incoming frames
sv: Definierar en mappning från VLAN-huvudets prioritet till Linux interna paketprioritet för inkommande ramar

source: Delay before enabling port after MII link down event (msec)
sv: Fördröjning innan porten aktiveras efter MII link-down-händelse (ms)

source: Delay before enabling port after MII link up event (msec)
sv: Fördröjning innan porten aktiveras efter MII link-up-händelse (ms)

source: Delay n seconds after connection
sv: Vänta n sekunder efter anslutning

source: Delay tun/tap open and up script execution
sv: Fördröj öppning av tun/tap och körning av up-skript

source: Delegate IPv6 prefixes
sv: Delegera IPv6-prefix

source: Delete key
sv: Radera nyckel

source: Delete request failed: %s
sv: Begäran om borttagning misslyckades: %s

source: Delete this config
sv: Ta bort den här konfigurationen

source: Delete this network
sv: Ta bort det här nätverket

source: Delivery Traffic Indication Message Interval
sv: Intervall för Delivery Traffic Indication Message

source: Deselect
sv: Avmarkera

source: Designated master
sv: Utsedd master

source: Dest Port
sv: Destinationsport

source: Destination port
sv: Destinationsport

source: Destination zone
sv: Destinationens zon

source: Device Configuration
sv: Enhetskonfiguration

source: Device Identifier
sv: Enhetsidentifierare

source: Device is not active
sv: Enheten är inte aktiv

source: Device is restarting…
sv: Enheten startas om…

source: Device name
sv: Enhetsnamn

source: Device not managed by ModemManager.
sv: Enheten hanteras inte av ModemManager.

source: Device not present
sv: Enheten finns inte

source: Device type
sv: Typ av enhet

source: Device unreachable!
sv: Enheten kan inte nås!

source: Device unreachable! Still waiting for device...
sv: Enheten kan inte nås! Väntar fortfarande på enheten…

source: Devices
sv: Enheter

source: Devices &amp; Ports
sv: Enheter och portar

source: Dial number
sv: Slå nummer

source: Dictates how long a node assumes a neighbor is reachable after a reachability confirmation; published in <abbr title="Router Advertisement">RA</abbr> messages.
sv: Anger hur länge en nod antar att en granne är nåbar efter en bekräftelse på nåbarhet; publiceras i <abbr title="Router Advertisement">RA</abbr>-meddelanden.

source: Diffie-Hellman parameters
sv: Diffie-Hellman-parametrar

source: Dir
sv: Kat

source: Directory for custom client config files
sv: Katalog för egna klientkonfigurationsfiler

source: Directory name
sv: Katalognamn

source: Directory name cannot be empty.
sv: Katalognamnet får inte vara tomt.

source: Directory to store IPv6 prefix information files in (to detect and announce stale prefixes).
sv: Katalog där filer med information om IPv6-prefix ska lagras (för att identifiera och annonsera inaktuella prefix).

source: Directory to store hosts files (IP address to hostname mapping) in. Used by e.g. <code>dnsmasq</code>.
sv: Katalog där hosts-filer (mappning mellan IP-adress och värdnamn) ska lagras. Används t.ex. av <code>dnsmasq</code>.

source: Directs packet flows to specific CPUs where the local socket owner listens (the local service).
sv: Styr paketflöden till specifika CPU:er där ägaren till den lokala socketen lyssnar (den lokala tjänsten).

source: Disable <abbr title="Dynamic Host Configuration Protocol">DHCP</abbr> for this interface (dnsmasq only).
sv: Inaktivera <abbr title="Dynamic Host Configuration Protocol">DHCP</abbr> för det här gränssnittet (endast dnsmasq).

source: Disable DNS lookups
sv: Inaktivera DNS-uppslag

source: Disable Data Channel Offloading (DCO) support
sv: Inaktivera stöd för Data Channel Offloading (DCO)

source: Disable Encryption
sv: Inaktivera kryptering

source: Disable Inactivity Polling
sv: Inaktivera inaktivitetskontroll

source: Disable Paging
sv: Inaktivera paging

source: Disable options consistency check
sv: Inaktivera kontroll av alternativens konsekvens

source: Disable this interface
sv: Inaktivera detta gränssnitt

source: Disable this network
sv: Inaktivera det här nätverket

source: Disable to manually control the duplex and link speed of the network device.
sv: Inaktivera för att manuellt styra duplex och länkhastighet för nätverksenheten.

source: Disables this interface for MPTCP
sv: Inaktiverar det här gränssnittet för MPTCP

source: Disassociate On Low Acknowledgement
sv: Koppla från vid låg ACK-kvalitet

source: Discard also upstream responses containing {rfc_4193_link}, Link-Local and private IPv4-Mapped {rfc_4291_link} IPv6 Addresses.
sv: Kassera även uppströmssvar som innehåller {rfc_4193_link}, länklokala adresser och privata IPv4-mappade {rfc_4291_link} IPv6-adresser.

source: Discard upstream responses containing {rfc_1918_link} addresses.
sv: Kassera uppströmssvar som innehåller {rfc_1918_link}-adresser.

source: Disconnection attempt failed
sv: Frånkopplingsförsöket misslyckades

source: Disconnection attempt failed.
sv: Frånkopplingsförsöket misslyckades.

source: Disk space
sv: diskutrymme

source: Distance Optimization
sv: Avståndsoptimering

source: Distance to farthest network member in meters. Set only for distances above one kilometer; otherwise it is harmful.
sv: Avstånd till den mest avlägsna nätverksmedlemmen i meter. Ange endast för avstånd över en kilometer; annars kan inställningen försämra funktionen.

source: Distributed ARP Table
sv: Distribuerad ARP-tabell

source: Dnsmasq instance to which this DHCP host section is bound. If unspecified, the section is valid for all dnsmasq instances.
sv: Dnsmasq-instans som den här DHCP-värdsektionen är bunden till. Om inget anges gäller sektionen för alla dnsmasq-instanser.

source: Dnsmasq instance to which this boot section is bound. If unspecified, the section is valid for all dnsmasq instances.
sv: Dnsmasq-instans som den här startsektionen är bunden till. Om inget anges gäller sektionen för alla dnsmasq-instanser.

source: Do not bind to local address and port
sv: Bind inte till lokal adress och port

source: Do not cache negative replies, e.g. for non-existent domains.
sv: Cachea inte negativa svar, t.ex för icke-existerade domäner.

source: Do not create host route to peer (optional).
sv: Skapa inte värdrutt till jämliken (valfritt).

source: Do not listen on the specified interfaces.
sv: Förhindra lyssning på dessa gränssnitt.

source: Do not offer DHCPv6 service on this interface.
sv: Erbjud inte DHCPv6-tjänst på det här gränssnittet.
